#+TITLE: Juank's Emacs Config
#+AUTHOR: Juan Camilo Prada
#+EMAIL: juankprada@gmail.com

*** Eglot
*TODO:* Move back to lsp-mode. For Ruby it seems LSP-Mode is way better
supported than Eglot. Provides more features and integrates better with Ruby-ts-mode

*STUDY:* Maybe it would be good to keep both and set Eglot mode to some prog-modes
while using LSP-mode for others.

Emacs LSP mode (different to lsp-mode). Eglot uses
way less packages and relies on external LSP servers. This way
it may be easier to actually integrat JAVA LSP into Emacs correctly with
ANT (still not something I'm sure how to handle).

#+begin_src emacs-lisp
  ;; (defun my-typescript-eglot-hook ()
  ;;   ((js-mode
  ;;     typescript-mode
  ;;     typescriptreact-mode) . eglot-ensure)
  ;;   ;; I'm not sure why this is needed, but it throws an error if I remove it
  ;;   (cl-defmethod project-root ((project (head eglot-project)))
  ;;     (cdr project))
  ;;   (defun my-project-try-tsconfig-json (dir)
  ;;     (when-let* ((found (locate-dominating-file dir "tsconfig.json")))
  ;;       (cons 'eglot-project found)))

  ;;   (add-hook 'project-find-functions
  ;;             'my-project-try-tsconfig-json nil nil)

  ;;   (add-to-list 'eglot-server-programs
  ;;                '((typescript-mode) "typescript-language-server" "--stdio"))
  ;;   )

  (use-package eglot
    :defer t
    :hook
    ((css-mode css-ts-mode
               ruby-mode ruby-ts-mode
               python-mode python-ts-mode
               yaml-mode yaml-ts-mode
               html-mode html-ts-mode
               js-mode js-ts-mode
               json-mode json-ts-mode
               scss-mode scss-ts-mode)
     . eglot-ensure)

    ((eglot-managed-mode . juank/eglot-eldoc)
     (eglot-managed-mode . juank/eglot-capf)
     )
    :preface
    (defun juank/eglot-eldoc ()
      ;; https://www.masteringemacs.org/article/seamlessly-merge-multiple-documentation-sources-eldoc
      (setq eldoc-documentation-strategy
            'eldoc-documentation-compose-eagerly))
    :config
    (add-to-list 'eglot-server-programs
                 '((ruby-mode ruby-ts-mode)  "ruby-lsp"))
    (setq eglot-events-buffer-size 0)
    (add-to-list 'eglot-stay-out-of 'flycheck)
    (setq completion-category-overrides '((eglot (styles orderless))))
    (setq-default eglot-workspace-configuration
                  '((:pylsp . (:configurationSources ["flake8"]
                                                     :plugins (
                                                               :pycodestyle (:enabled :json-false)
                                                               :mccabe (:enabled :json-false)
                                                               :pyflakes (:enabled :json-false)
                                                               :flake8 (:enabled :json-false
                                                                                 :maxLineLength 88)
                                                               :ruff (:enabled t
                                                                               :lineLength 88)
                                                               :pydocstyle (:enabled t
                                                                                     :convention "numpy")
                                                               :yapf (:enabled :json-false)
                                                               :autopep8 (:enabled :json-false)
                                                               :black (:enabled t
                                                                                :line_length 88
                                                                                :cache_config t))))))
    (defun juank/eglot-capf ()
      ;; I don't want `eglot-completion-at-point' to trample my other completion
      ;; options.
      ;;
      ;; https://stackoverflow.com/questions/72601990/how-to-show-suggestions-for-yasnippets-when-using-eglot
      (setq-local completion-at-point-functions
                  (list (cape-capf-super
                         #'juank/version-control/project-capf
                         #'juank/version-control/issue-capf
                         #'eglot-completion-at-point

                         #'cape-keyword))))
    )

#+end_src

#+RESULTS:
| doom-modeline-override-eglot | doom-modeline-update-eglot | juank/eglot-capf | juank/eglot-eldoc |

